from lang.colors import Colors
from colorama import Fore, Style, init


translations = {
    'hello': 'Сәлеметсіз бе',
    'welcome': 'Қайырлы күн, Galacticos дүкенінің құрметті сатып алушысы! '
               'Мен чат-ботпын – Playstation-ға қатысты сұрақтар бойынша сізге көмек көрсетемін',
    'greeting_morning': 'Қайырлы таң!',
    'greeting_day': 'Қайырлы күн!',
    'greeting_evening': 'Қайырлы кеш!',
    'main_menu_greeting': 'Сәлем!',


    'problem_message': 'Проблеманы таңдаңыз:',
    'contact_request': 'Сатып алуды аяқтау үшін байланыс ақпаратыңызды жіберіңіз.',
    'purchase_confirmation': 'Сіздің сатып алу сұрауыңыз жіберілді. Біз жақын арада сізбен байланысамыз!',
    'help_user': 'Сізге қандай көмек көрсете аламын?',
    'questions_p4': 'Кешіріңіз, қандай проблема болды?',
    'choose_language': 'Тілді таңдаңыз:',
    'greeting_message': 'Қазақ тілін таңдадыңыз!',

#
    'back_button': '/Артқа',
    'restart_button': '/Басынан',
    'button_1': 'PS4-пен проблема бар',
    'button_2': 'PS5-пен проблема бар',
    'button_3': 'Жеткізу бойынша сұрақтар',
    'button_4': 'Поштадан цифрлық код керек',

# buttons for ps4 problems
    'button_connecting_ps4': 'PS4 қосу',
    'button_connecting_ps5': 'PS5 қосу',
    'button_game_blocked': 'Ps4 ойындарында құлып белгісі пайда болды, және олар ашылмай жатыр',
    'button_game_blocked_ps5': 'Ps5 ойындарында құлып белгісі пайда болды, және олар ашылмай жатыр',
    'button_game_blocked_password': 'Ps4 ойындарында құлып белгісі пайда болды, ал ойынды іске қосқанда жүйе пароль енгізуді сұрайды',
    'button_game_blocked_password_ps5': 'Ps5 ойындарында құлып белгісі пайда болды, ал ойынды іске қосқанда жүйе пароль енгізуді сұрайды',
    'button_download_games': 'Ps4-ке ғаламтордан ойындарды қалай жүктеуге болады?',
    'button_download_games_p5': 'Ps5-ке ғаламтордан ойындарды қалай жүктеуге болады?',
    'button_no_works': 'Бірдеме жұмыс жасамай тұрма?',
    'ps4_gamepad': 'PS4-ке екінші джойстык қалай қосуға болады?',
    'ps5_gamepad': 'PS5-ке екінші джойстык қалай қосуға болады?',
    'question_1': 'Сіздің мәселеңіз шешілді ме?',

# connecting problem's answers
    'answer_1': 'PS 4-ті бірінші рет қосу'
                '\n\nТекст нұсқаулық және бейне нұсқаулық (YouTube сілтемесі: https://www.youtube.com/watch?v=e-tdz7fxq7M)'
                '\n\nHDMI кабелін PS4® консолінің артқы панеліндегі HDMI OUT ұясына қосыңыз.'
                '\n\nСодан кейін сол HDMI кабелін теледидарыңыздағы HDMI ұясына жалғаңыз.'
                '\n\nҚуат кабелін PS4 консолінің артқы панеліндегі AC IN ұясына қосыңыз. '
                '\n\nШтепсельді электр розеткасына сенімді түрде қосыңыз.'
                '\n\nТеледидар пультіндегі ұяшықтар арасындағы ауыстыру түймесін тауып, HDMI таңдаңыз.'
                '\n\nUSB кабелін PS4 алдыңғы панеліне қосыңыз.'
                '\n\nUSB – microUSB кабелінің екінші ұшын джойстикке жалғап, джойстиктің ортасындағы PS түймесін басыңыз.'
                '\n\nКез келген "User" профиліне кіріңіз.',
    'answer_2': 'Текст нұсқаулық және бейне нұсқаулық (YouTube сілтемесі: https://www.youtube.com/watch?v=dzvtbPdc3CM&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation) '
                '\n\nОйындар бар аккаунтқа құпия код арқылы кіріңіз: джойстик түймелерімен L2R2L1R1 комбинациясын басыңыз. '
                '\n\nПараметрлер —> Аккаунтты басқару бөліміне өтіңіз. '
                '\n\nPS негізгі жүйесі ретінде іске қосу —> Іске қосу —> OK басыңыз. '
                '\n\nЛицензияларды қалпына келтіру —> Қалпына келтіру —> OK басыңыз. '
                '\n\nОйындарды сәтті іске қосқаннан кейін, Желі бөліміне өтіп, ғаламторға қосылу белгісін алып тастаған жөн (бұл Sony лицензияларының тексерілмеуі және ойындардың өшірілмеуі үшін). '
                '\n\nСодан кейін, Қуат —> PS жүйесінен шығу бөліміне кіріп, кез келген «User» пайдаланушысына ауысыңыз. '
                '\n\nОйынды іске қосып, процесті тамашалаңыз.',
    'answer_3': ' Текст нұсқаулық және бейне нұсқаулық (YouTube сілтемесі: https://www.youtube.com/watch?v=3ackK2hF-Xc&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation) '
                '\n\nПараметрлер —> Аккаунтты басқару —> Желіні қосу. '
                '\n\nЛогин автоматты түрде көрсетіледі, ал аккаунт паролін гарантия талонының соңғы бетінен таба аласыз (әдетте, fipa7578XXXXXX-дан басталады). '
                '\n\nПарольді енгізіп, Желіні қосу түймесін басыңыз. '
                '\n\nPS негізгі жүйесі ретінде іске қосу —> Іске қосу —> OK. '
                '\n\nЛицензияларды қалпына келтіру —> Қалпына келтіру —> OK. '
                '\n\nОйындарды сәтті іске қосқаннан кейін, Желі бөліміне өтіп, ғаламторға қосылу белгісін алып тастау ұсынылады (бұл Sony лицензияларының тексерілмеуі және ойындардың өшірілмеуі үшін). '
                '\n\nСодан кейін, Қуат —> PS жүйесінен шығу бөліміне кіріп, кез келген «User» пайдаланушысына ауысыңыз. '
                '\n\nОйынды іске қосып, процесті тамашалаңыз.',
    'answer_4': 'Текст нұсқаулық және бейне нұсқаулық (YouTube сілтемесі: https://www.youtube.com/watch?v=QTW-RPKUHL4&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation) '
                '\n\nКез келген «User» аккаунтына кіріңіз —> Параметрлер —> Желі —> Ғаламтормен қосу. '
                '\n\nОйындарды тез жүктеу үшін LAN кабелін қосу ұсынылады. '
                '\n\nНегізгі мәзірге өтіп, сол жақ жоғарғы бұрышта Хабарламалар бөлімін тауып, Жүктеулер бөліміне кіріңіз. '
                '\n\nМұнда ойындарды жүктеудің қанша уақыт алатынын көресіз. (Назар аударыңыз, кейбір жағдайларда ойындар бұрын жүктеліп, дайын болуы мүмкін, осындай жағдайда ойынды іске қоса аласыз).Ғаламторға қосылғаннан кейін, қажет болған жағдайда ойындарды жүктеу үшін, Негізгі мәзірде Қуат бөліміне кіріңіз, '
                '\n\nҰйқы режиміне өту пунктін таңдаңыз (Ұйқы режимінде жүктеу жалғасады).',
    'answer_5': 'Бірдеме жұмыс жасамай тұрма? '
                '\n\n -Джойстик \n\т-Приставка \n\nТехникалық қолдау қызметіне ватсап арқылы '
                'мына нөмірге жазыңыз: 87472223521.'
                '\n\nҚОҢЫРАУЛАР ҚАБЫЛДАНБАЙДЫ. ТЕК ВАТСАП!!!'
                '\n\nЖұмыс кестесі: дүйсенбіден жұмаға дейін сағат 9:00-ден 18:00-ге дейін',
    'answer_6': '3.1 Қазақстан бойынша жеткізу'
                '\n\nЕгер сізде Қазақстанның әртүрлі қалаларына жеткізу туралы сұрақтарыңыз болса, 9999 нөміріне қоңырау шалып, тапсырыс нөміріңізді айтып, сұрағыңызды Kaspi Bank менеджеріне қоюыңыз қажет. '
                '\n\n3.2 Алматы қаласы бойынша жеткізу '
                '\n\nБіздің дүкен Алматы қаласында орналасқан. '
                'Егер жеткізу уақыты туралы сұрақтарыңыз болса, 87476595882 нөміріне қоңырау шалыңыз.',
    'answer_8': 'Егер сізден аккаунт паролін енгізгеннен кейін код сұраса, біздің менеджер сізбен хабарласып, '
                'кодты жібереді.'
                '\n\nӨтініш, күтіңіз',
    'answer_9': 'PS4-ке екінші джойстык қалай қосуға болады? (https://www.youtube.com/watch?v=FPZXzE-lfw0&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation)'
                '\n\nБірінші джойстикті USB кабелі арқылы қосып, USER1 аккаунтына кіріңіз.'
                '\n\nДжойстикті кабельден ажыратып, екінші джойстикті кабель арқылы қосыңыз.'
                '\n\nДжойстиктің ортасындағы PS батырмасын басып, USER2 аккаунтын таңдаңыз. '
                '\n\nЕнді екі джойстик қосулы. '
                '\n\nБірақ олар бір уақытта тек екі немесе одан да көп ойыншыға арналған ойындарда ғана жұмыс істейді.',

#ps5
    'answer_10': 'Текст нұсқаулық және бейне нұсқаулық (YouTube сілтемесі: https://www.youtube.com/watch?v=vzAq2Bi8cLM&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation)'
                '\n\nHDMI кабелін PS5® консолінің артқы панеліндегі HDMI OUT ұясына қосыңыз.'
                '\n\nСодан кейін сол HDMI кабелін теледидарыңыздағы HDMI ұясына жалғаңыз.'
                '\n\nҚуат кабелін PS5 консолінің артқы панеліндегі AC IN ұясына қосыңыз. '
                '\n\nШтепсельді электр розеткасына сенімді түрде қосыңыз.'
                '\n\nТеледидар пультіндегі ұяшықтар арасындағы ауыстыру түймесін тауып, HDMI таңдаңыз.'
                '\n\nUSB кабелін PS5 алдыңғы панеліне қосыңыз.'
                '\n\nUSB – microUSB кабелінің екінші ұшын джойстикке жалғап, джойстиктің ортасындағы PS түймесін басыңыз.'
                '\n\nКез келген "User" профиліне кіріңіз.',
    'answer_11': 'PS5-ке екінші джойстык қалай қосуға болады? (https://www.youtube.com/watch?v=FPZXzE-lfw0&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation)'
                '\n\nБірінші джойстикті USB кабелі арқылы қосып, USER1 аккаунтына кіріңіз.'
                '\n\nДжойстикті кабельден ажыратып, екінші джойстикті кабель арқылы қосыңыз.'
                '\n\nДжойстиктің ортасындағы PS батырмасын басып, USER2 аккаунтын таңдаңыз. '
                '\n\nЕнді екі джойстик қосулы. '
                '\n\nБірақ олар бір уақытта тек екі немесе одан да көп ойыншыға арналған ойындарда ғана жұмыс істейді.',
    'answer_12': ' Текст нұсқаулық және бейне нұсқаулық (YouTube сілтемесі:https://www.youtube.com/watch?v=LgGLWeX5a6c&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation) '
                '\n\nПараметрлер —> Аккаунтты басқару —> Желіні қосу. '
                '\n\nЛогин автоматты түрде көрсетіледі, ал аккаунт паролін гарантия талонының соңғы бетінен таба аласыз (әдетте, fipa7578XXXXXX-дан басталады). '
                '\n\nПарольді енгізіп, Желіні қосу түймесін басыңыз. '
                '\n\nPS негізгі жүйесі ретінде іске қосу —> Іске қосу —> OK. '
                '\n\nЛицензияларды қалпына келтіру —> Қалпына келтіру —> OK. '
                '\n\nОйындарды сәтті іске қосқаннан кейін, Желі бөліміне өтіп, ғаламторға қосылу белгісін алып тастау ұсынылады (бұл Sony лицензияларының тексерілмеуі және ойындардың өшірілмеуі үшін). '
                '\n\nСодан кейін, Қуат —> PS жүйесінен шығу бөліміне кіріп, кез келген «User» пайдаланушысына ауысыңыз. '
                '\n\nОйынды іске қосып, процесті тамашалаңыз.',
    'answer_13': ' Текст нұсқаулық және бейне нұсқаулық (YouTube сілтемесі: https://www.youtube.com/watch?v=cPTvOlj2riM&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation) '
                 '\n\nПараметрлер —> Аккаунтты басқару —> Желіні қосу. '
                 '\n\nЛогин автоматты түрде көрсетіледі, ал аккаунт паролін гарантия талонының соңғы бетінен таба аласыз (әдетте, fipa7578XXXXXX-дан басталады). '
                 '\n\nПарольді енгізіп, Желіні қосу түймесін басыңыз. '
                 '\n\nPS негізгі жүйесі ретінде іске қосу —> Іске қосу —> OK. '
                 '\n\nЛицензияларды қалпына келтіру —> Қалпына келтіру —> OK. '
                 '\n\nОйындарды сәтті іске қосқаннан кейін, Желі бөліміне өтіп, ғаламторға қосылу белгісін алып тастау ұсынылады (бұл Sony лицензияларының тексерілмеуі және ойындардың өшірілмеуі үшін). '
                 '\n\nСодан кейін, Қуат —> PS жүйесінен шығу бөліміне кіріп, кез келген «User» пайдаланушысына ауысыңыз. '
                 '\n\nОйынды іске қосып, процесті тамашалаңыз.',
    'answer_14': 'Текст нұсқаулық және бейне нұсқаулық (YouTube сілтемесі: https://www.youtube.com/watch?v=xn9PCwJe5Kc&ab_channel=Galacticos-%D0%B2%D1%81%D1%91%D0%BF%D1%80%D0%BEPlayStation) '
                '\n\nКез келген «User» аккаунтына кіріңіз —> Параметрлер —> Желі —> Ғаламтормен қосу. '
                '\n\nОйындарды тез жүктеу үшін LAN кабелін қосу ұсынылады. '
                '\n\nНегізгі мәзірге өтіп, сол жақ жоғарғы бұрышта Хабарламалар бөлімін тауып, Жүктеулер бөліміне кіріңіз. '
                '\n\nМұнда ойындарды жүктеудің қанша уақыт алатынын көресіз. (Назар аударыңыз, кейбір жағдайларда ойындар бұрын жүктеліп, дайын болуы мүмкін, осындай жағдайда ойынды іске қоса аласыз).Ғаламторға қосылғаннан кейін, қажет болған жағдайда ойындарды жүктеу үшін, Негізгі мәзірде Қуат бөліміне кіріңіз, '
                '\n\nҰйқы режиміне өту пунктін таңдаңыз (Ұйқы режимінде жүктеу жалғасады).',
    # we ask did you finish your problem?
    'yes': '/Иә',
    'no': '/Жоқ',
    'bye': 'Көмектескеніме қуаныштымын! '
           'Пайдалануыңызға сәттілік тілеймін. Қосымша сұрақтар туындаса, хабарласыңыз',
    'we_call_you': 'Өкінішті. Ренжіменіз,'
                   ' сізбен жұмыс уақытында менеджер байланысып көмектеседі. Сұраным жіберілді',
    'asks_again': 'Сұраным өңделуде. Күтіңіз, менеджер кезек тәртібімен жауап береді',
    'so_sad': 'Өкінішті. Көңіліңізді түсірмеңіз, менеджер сізге жұмыс уақытында хабарласып, көмек көрсетеді. Сұраныс жіберілді.',
    'send_you_number': 'Өтініш, нөміріңізді бізге жіберіңіз',
    'you_welcome': 'Көмек көрсете алғаныма қуаныштымын! Пайдалануыңыз сәтті болсын. Қосымша сұрақтар туындаса — хабарласыңыз.',
    'you_sent': 'Жіберілген сұрауыңыз бар. Күтіңіз, менеджер кезек бойынша жауап береді.',
    'share_contact': 'Контактімен бөлісу',
    'no_contact_received': 'no_contact_received',
    'unrecognized_command': 'unrecognized_command',

    'choose_complaint': 'Проблеманы таңдаңыз',
    'time_1': 'Осы уақыт аралығында: 9:00 - 11:00',
    'time_2': 'Осы уақыт аралығында: 11:00 - 13:00',
    'time_3': 'Осы уақыт аралығында: 13:00 - 15:00',
    'time_4': 'Осы уақыт аралығында: 15:00 - 17:00',
    'time_5': 'Осы уақыт аралығында: 17:00 - 18:00',
    'choose_call_time': 'Өтініш, қоңырау шалу үшін ыңғайлы уақытты таңдаңыз:',
    'call_time_confirm': 'Қоңырау шалу уақытын: {time} таңдадыңыз.'
                   ' Сізбен жұмыс уақытында менеджер байланысып көмектеседі. Сұраным жіберілді',
}